app/Controllers/Admin.php

    public function kategori(): string
    {
        $kategori = $this->kategoriModel->getAllKategori();
        $totalKategori = count($kategori);

        // Count products per category
        $produkModel = new \App\Models\ProdukModel();
        foreach ($kategori as &$kat) {
            $kat['jumlah_produk'] = $produkModel->where('id_kategori', $kat['id_kategori'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `id_kategori` = '1'

    public function menu(): string
    {
        $menu = $this->menuModel->getAllMenu();
        $kategori = $this->kategoriModel->getAllKategori();
        $totalMenu = count($menu);

        // Count products per menu
        $produkModel = new \App\Models\ProdukModel();
        foreach ($menu as &$m) {
            $m['jumlah_produk'] = $produkModel->where('id_menu', $m['id_menu'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `id_menu` = '1'

            }

            // Insert product first
            $id_produk = $this->produkModel->insert($data);
---
INSERT INTO `produk` (`id_toko`, `nama_produk`, `deskripsi_produk`, `id_kategori`, `id_menu`, `merek`, `harga_awal`, `harga_diskon`, `tipe_diskon`, `id_promo`, `harga_setelah_diskon`, `stok`, `sku`, `berat`, `status_produk`, `created_at`, `updated_at`) VALUES ('1', 'mie kuah', 'unsndsu', 1, 1, 'Indofood', 5000, 10, 'persentase', NULL, 4500, 10, 'SKU-002', 2, 'aktif', '2025-12-17 06:25:40', '2025-12-17 06:25:40')