app/Models/KategoriModel.php

    public function getKategoriAktif()
    {
        return $this->where('status', 'aktif')->orderBy('nama_kategori', 'ASC')->findAll();
---
SELECT *
FROM `kategori`
WHERE `status` = 'aktif'
ORDER BY `nama_kategori` ASC

    public function getAllKategori()
    {
        return $this->orderBy('nama_kategori', 'ASC')->findAll();
---
SELECT *
FROM `kategori`
ORDER BY `nama_kategori` ASC