app/Models/MenuModel.php

    public function getMenuAktif($id_kategori = null)
    {
        $builder = $this->where('status', 'aktif');
        if ($id_kategori !== null) {
            $builder->where('id_kategori', $id_kategori);
        }
        return $builder->orderBy('nama_menu', 'ASC')->findAll();
---
SELECT *
FROM `menu`
WHERE `status` = 'aktif'
AND `id_kategori` = '1'
ORDER BY `nama_menu` ASC

    public function getAllMenu($id_kategori = null)
    {
        $builder = $this->db->table($this->table . ' m');
        $builder->select('m.*, k.nama_kategori');
        $builder->join('kategori k', 'k.id_kategori = m.id_kategori', 'left');

        if ($id_kategori !== null) {
            $builder->where('m.id_kategori', $id_kategori);
        }

        $builder->orderBy('k.nama_kategori', 'ASC');
        $builder->orderBy('m.nama_menu', 'ASC');
        return $builder->get()->getResultArray();
---
SELECT `m`.*, `k`.`nama_kategori`
FROM `menu` `m`
LEFT JOIN `kategori` `k` ON `k`.`id_kategori` = `m`.`id_kategori`
ORDER BY `k`.`nama_kategori` ASC, `m`.`nama_menu` ASC