app/Models/ProdukModel.php

    public function getProduk($id_toko = null)
    {
        $builder = $this->db->table($this->table . ' p');
        $builder->select('p.*, k.nama_kategori, m.nama_menu, pr.nama_promo');
        $builder->join('kategori k', 'k.id_kategori = p.id_kategori', 'left');
        $builder->join('menu m', 'm.id_menu = p.id_menu', 'left');
        $builder->join('promo pr', 'pr.id_promo = p.id_promo', 'left');

        if ($id_toko !== null) {
            $builder->where('p.id_toko', $id_toko);
        }

        $builder->orderBy('p.created_at', 'DESC');
        return $builder->get()->getResultArray();
---
SELECT `p`.*, `k`.`nama_kategori`, `m`.`nama_menu`, `pr`.`nama_promo`
FROM `produk` `p`
LEFT JOIN `kategori` `k` ON `k`.`id_kategori` = `p`.`id_kategori`
LEFT JOIN `menu` `m` ON `m`.`id_menu` = `p`.`id_menu`
LEFT JOIN `promo` `pr` ON `pr`.`id_promo` = `p`.`id_promo`
WHERE `p`.`id_toko` = '1'
ORDER BY `p`.`created_at` DESC

    public function getProdukById($id)
    {
        $builder = $this->db->table($this->table . ' p');
        $builder->select('p.*, k.nama_kategori, m.nama_menu, pr.nama_promo');
        $builder->join('kategori k', 'k.id_kategori = p.id_kategori', 'left');
        $builder->join('menu m', 'm.id_menu = p.id_menu', 'left');
        $builder->join('promo pr', 'pr.id_promo = p.id_promo', 'left');
        $builder->where('p.id_produk', $id);
        return $builder->get()->getRowArray();
---
SELECT `p`.*, `k`.`nama_kategori`, `m`.`nama_menu`, `pr`.`nama_promo`
FROM `produk` `p`
LEFT JOIN `kategori` `k` ON `k`.`id_kategori` = `p`.`id_kategori`
LEFT JOIN `menu` `m` ON `m`.`id_menu` = `p`.`id_menu`
LEFT JOIN `promo` `pr` ON `pr`.`id_promo` = `p`.`id_promo`
WHERE `p`.`id_produk` = '5'

    public function getProdukFoto($id_produk)
    {
        $builder = $this->db->table('produk_foto');
        $builder->where('id_produk', $id_produk);
        $builder->orderBy('urutan', 'ASC');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `produk_foto`
WHERE `id_produk` = '4'
ORDER BY `urutan` ASC

    public function countProdukByToko($id_toko)
    {
        return $this->where('id_toko', $id_toko)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `id_toko` = '1'