app/Models/PromoModel.php

SELECT *
FROM `promo`
WHERE `status` = 'aktif'
AND `tanggal_mulai` <= '2025-12-17 06:24:20'
AND `tanggal_berakhir` >= '2025-12-17 06:24:20'
AND `id_toko` = '1'
ORDER BY `tanggal_mulai` DESC
---
    public function getPromoAktif($id_toko = null)
    {
        $builder = $this->where('status', 'aktif');
        $builder->where('tanggal_mulai <=', date('Y-m-d H:i:s'));
        $builder->where('tanggal_berakhir >=', date('Y-m-d H:i:s'));

        if ($id_toko !== null) {
            $builder->where('id_toko', $id_toko);
        }

        return $builder->orderBy('tanggal_mulai', 'DESC')->findAll();