app/Models/TokoModel.php

SELECT *
FROM `toko`
 LIMIT 1
---
    public function getToko()
    {
        return $this->first();